class Flowers {
  final String name;
  final String image;
  final String price;
  final String description;
  final String specifications;
  final String video;

  Flowers(this.name, this.image, this.price, this.description,
      this.specifications, this.video);
}

List<Flowers> flowersList = [
  Flowers(
      "Букет из 11 альстромерий микс",
      'https://content3.flowwow-images.com/data/flowers/1000x1000/45/1692180522_5439345.jpg',
      "1791 ₽",
      "Букет из ярких альстромерий, выполнен в оригинальной дизайнерской упаковке . Упаковка надежно защитит цветы и придаст букету особый шарм. Дополнительно украшен атласной лентой, которая добавляет изысканности и элегантности. Такой букет станет прекрасным подарком для любого случая и порадует своего получателя своей красотой и нежностью.",
      "Альстромерия - 11 шт., Лента атласная - 1 шт., Дизайнерская упаковка - 2 шт.",
      ''),
  Flowers(
      "Букет из 21 фиолетового ириса в упаковке",
      'https://content2.flowwow-images.com/data/flowers/524x524/71/1679919880_90681571.jpg',
      "3267 ₽",
      "Шикарный букет из ярких ирисов в модном оформлении. Такой букет актуален на любое торжество ! Букет цветов — обязательный презент для любой представительницы прекрасной половины человечества. Цветы – это красивый способ сделать женщину счастливой. Флористы каждый день создают букеты из свежих цветов, чтобы вы могли порадовать ими своих близких и любимых.Наши букеты подходят под любой праздник и торжество: день рождение, юбилей, признание в любви , для мамы и просто так-чтобы поднять настроение и пожелать хорошего дня",
      "Ирис - 21 шт., Лента атласная - 1 шт.,Упаковка крафт - 2 шт.",
      ''),
  Flowers(
      "Букет из 9 Гербер микс в крафте",
      'https://content3.flowwow-images.com/data/flowers/524x524/62/1692008024_34931362.jpg',
      "1611 ₽",
      "Самые красивые герберы подарят яркие эмоции для вашего любимого человека. Цвета гербер могут отличаться от поставки.",
      "Лента атласная - 1 шт., Гербера - 9 шт., Крафт - 2 шт.",
      ''),
  Flowers(
      "Букет из роз 9 шт",
      'https://content3.flowwow-images.com/data/flowers/524x524/87/1701974678_72883487.jpg',
      "3371 ₽",
      "Прекрасный классический букет",
      "Лента атласная - 1 шт., Упаковка дизайнерская - 1 шт., розы 60 см - 9 шт.",
      ''),
  Flowers(
      "Букет из 11 белых Калл",
      'https://content2.flowwow-images.com/data/flowers/1000x1000/25/1708860250_47166925.jpg',
      "4620 ₽",
      "Белые каллы – утонченные и величественные цветы. Их строгая красота завораживает, заставляя восхищаться столь совершенным творением природы. Цветы в срезанном виде неделями не теряют своей свежести, позволяя долго любоваться оригинальными бутонами. Их дарят как знак преклонения и признательности. Композиция из белых калл – роскошный подарок по случаю дня рождения, свадьбы или особой торжественной даты.",
      "Лента атласная - 1 шт., белые каллы - 11 шт.",
      ''),
  Flowers(
      "51 тюльпан микс",
      'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1551140746/lmcode/9QPoh7Mqq0Gzj2qT9GtNtw/12511916.png',
      "5775 ₽",
      "Цикламен (Cyclamen) — это невысокий (до 30 см) травянистый многолетник с яркими длинночерешковыми прикорневыми листьями и одиночными цветками на длинных цветоносах. Подходит для выращивания в помещении, а также в саду и на балконе. Цветение приходится на конец лета — начало осени.",
      "Тип продукта - Комнатное растение; Тип растения - Цветущее растение; Род растений - Цикламен; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Высота товара в индивидуальной упаковке (см) - 37; Глубина товара в индивидуальной упаковке (см) - 23; Ширина товара в индивидуальной упаковке (см) - 31; Вес товара в индивидуальной упаковке (кг) - 0.926",
      'dLACj0TpCRc'),
  Flowers(
      "Розовые диантусы (М)",
      'https://content3.flowwow-images.com/data/flowers/524x524/59/1661720577_91468559.jpg',
      "1900 ₽.",
      "Примула — цветущее растение. Многолетнее комнатное растение с яркими цветками. Предпочитает яркий, но рассеянный свет и умеренный полив. Примулы цветут обильно и долго, создавая атмосферу комфорта и уюта. Листва устойчива к опаданию.",
      "Тип продукта - Комнатное растение; Тип растения - Цветущее растение; Род растений - Примула; Цветовая палитра - Разноцветный; Цвет листвы - Зеленый; Высота растения max (см) - 15; Место посадки - Освещение; Допустимая температура (° C) - От 15 до 20°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 18; Глубина товара в индивидуальной упаковке (см) - 10.8; Ширина товара в индивидуальной упаковке (см) - 10.8; Вес товара в индивидуальной упаковке (кг) - 0.43",
      'dLACj0TpCRc'),
  Flowers(
      "Букет из 15 белых кустовых хризантем",
      'https://content2.flowwow-images.com/data/flowers/524x524/52/1708923392_98767552.jpg',
      "2000 ₽/шт.",
      "Гербера - многолетнее растение, относится к семейству Астровые. Очень любит естественный свет и не боится попадания прямых солнечных лучей. При надлежащем уходе цветы распускаются 2 раза в год (весной и осенью). Нельзя допускать пересушивания грунта. Однако чрезмерный полив способствует развитию грибковых заболеваний. Орошение проводится теплой водой. Слишком низкая температура может привести к гибели растения. Чтобы листья имели сочный зеленый цвет важно их часто опрыскивать, особенно в засушливое время года.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Гербера; Тип удобрения - Универсальное удобрение, подходит для комнатных растений; Страна производства - Россия; Высота товара в индивидуальной упаковке (см) - 40; Глубина товара в индивидуальной упаковке (см) - 30; Ширина товара в индивидуальной упаковке (см) - 24; Вес товара в индивидуальной упаковке (кг) - 0.775",
      ''),
  Flowers(
      "Вишнёвые ромашки 11 шт",
      'https://content3.flowwow-images.com/data/flowers/524x524/75/1657630415_13500475.jpg',
      "2650 ₽",
      "Очаровательные ромашковые хризантемы насыщенного вишневого оттенка с оформлением в тон. Стильный и стойкий букет! доставка цветов. Такой букет всегда уместен и подойдёт для любого повода: День Рождения, именины, годовщина свадьбы, рождение ребенка, 8 марта, День Святого Валентина, День Семьи, выпускной и т.д. Можно вручить маме, сестре, подруге, коллеге, учителю, любимой.",
      "Упаковка дизайнерская - 1 шт., Хризантема кустовая ромашковая - 11 шт.",
      ''),
  Flowers(
      "11 нежно-розовых роз в крафте",
      'https://content2.flowwow-images.com/data/flowers/524x524/25/1591454507_88244425.jpg',
      "2990 ₽",
      "Фаленопсис микс — светолюбивое растение с 1 стрелкой, укороченным стеблем и небольшим количеством светло-зеленых листовых пластин. Высота этой разновидности орхидеи — 45 см.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Фаленопсис; Сорт - Микс; Цвет листвы - Зеленый; Высота растения max (см) - 75; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 50.4; Глубина товара в индивидуальной упаковке (см) - 11; Ширина товара в индивидуальной упаковке (см) - 11; Вес товара в индивидуальной упаковке (кг) - 0.423",
      ''),
  Flowers(
      "7 розовых пионов. Букет пионов",
      'https://content2.flowwow-images.com/data/flowers/524x524/73/1686108539_15727673.jpg',
      "5800 ₽",
      "Пионы сорта сара Бернар. Старинный французский сорт. Аромат озарит всю вашу квартиру. Букет комплимент. Подойдёт как отдельный подарок так и дополнение к основному подарку.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Растение в ассортименте; Сорт - Микс; Цветовая палитра - Красный; Цвет листвы - Зеленый; Цвет плодов - Без фруктов; Высота растения max (см) - 40; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 25°; Частота подкормки (среднее значение) - 1 раз в две недели; Тип удобрения - Удобрение для цветущих растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 41.6; Глубина товара в индивидуальной упаковке (см) - 12.8; Ширина товара в индивидуальной упаковке (см) - 12.6; Вес товара в индивидуальной упаковке (кг) - 0.438",
      ''),
  Flowers(
      "Букет-комплимент из нежно-розовых гвоздик",
      'https://content2.flowwow-images.com/data/flowers/1000x1000/16/1687341297_19387316.jpg',
      "1380 ₽",
      "Дендробиум — один из наиболее многочисленных родов в семействе Орхидных. Дендробиумы характеризуются продолжительным цветением в домашних условиях. Обладают приятными ароматами. Растения уверенно лидируют в рейтинге популярности комнатных цветов. Уход за ними не прост. Светолюбив. Дендробиумам необходима высокая влажность воздуха. Обильный полив во время активного роста (теплый душ или погружение горшка в воду) при наступлении периода покоя сводится к редким водным процедурам по мере полного высыхания земляного кома. Подкормка специальными удобрениями проводится только в течение периода вегетации и полностью прекращается по окончании цветения.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Дендробиум; Сорт - Аполлон; Место посадки - Освещение; Допустимая температура (° C) - От 15 до 25°; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Тип упаковки - Банка/Горшок; Высота товара в индивидуальной упаковке (см) - 48.9; Глубина товара в индивидуальной упаковке (см) - 11; Ширина товара в индивидуальной упаковке (см) - 11; Вес товара в индивидуальной упаковке (кг) - 0.504",
      ''),
  Flowers(
      "Кустовые пионовидные розы Misty Bubbles в эко-упаковке из крафта",
      'https://content2.flowwow-images.com/data/flowers/1000x1000/72/1690743342_65633172.jpg',
      "1 650₽/шт.",
      "Идеально подойдет для любого повода - Дня рождения, юбилея и просто чтобы сделать чей-то день приятнее",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Цветущее растение; Род растений - Гортензия; Сорт - Макрофила; Цвет листвы - Зеленый; Высота растения max (см) - 22; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 10 до 25°; Частота подкормки (среднее значение) - 1 раз в две недели; Тип удобрения - Удобрение для цветущих растений; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 22; Глубина товара в индивидуальной упаковке (см) - 10.5; Ширина товара в индивидуальной упаковке (см) - 10.5; Вес товара в индивидуальной упаковке (кг) - 0.35",
      ''),
  Flowers(
      "Букет-комплимент из Ранункулюсов",
      'https://content2.flowwow-images.com/data/flowers/1000x1000/15/1709635862_15552815.jpg',
      "2 600₽/шт.",
      "Фаленопсис Солид голд можно назвать настоящим золотом, растение способствует развитию у ее владельца практичности, а также интуиции, значительно повышает ментальные способности, логическое мышление. Это комнатное растение великолепно подойдет для подарка мужчине или женщине. Фаленопсис Солид голд — неприхотливое вечнозеленое растение, цветущее практически круглый год, идеально подходит для начинающих цветоводов.",
      "Тип продукта - Комнатное растение; Тип продукта (локальный) - Комнатное растение; Тип растения - Орхидея; Род растений - Фаленопсис; Сорт - Солид Голд; Цвет листвы - Зеленый; Высота растения max (см) - 80; Место посадки - Полутень / солнце; Допустимая температура (° C) - От 15 до 30°; Частота подкормки (среднее значение) - 1 раз в месяц; Тип удобрения - Удобрение для орхидей; Страна производства - Россия; Количество в наборе - 1; Тип упаковки - Без упаковки; Высота товара в индивидуальной упаковке (см) - 60.1; Глубина товара в индивидуальной упаковке (см) - 11.5; Ширина товара в индивидуальной упаковке (см) - 11.5; Вес товара в индивидуальной упаковке (кг) - 0.382",
      '')
];

class Fimage {
  List<String> fimage;

  Fimage(this.fimage);
}

List<Fimage> fimageList = [
  Fimage([
    'https://content3.flowwow-images.com/data/flowers/1000x1000/45/1692180522_5439345.jpg',
    'https://content3.flowwow-images.com/data/flowers/1000x1000/19/1692180522_9852619.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/21/1692180522_11712821.jpg'
  ]),
  Fimage([
    'https://content2.flowwow-images.com/data/flowers/524x524/71/1679919880_90681571.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/86/1679919880_80939886.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/91/1679919880_94333191.jpg'
  ]),
  Fimage([
    'https://content3.flowwow-images.com/data/flowers/524x524/62/1692008024_34931362.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/00/1692008024_85200900.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/89/1692008024_78306589.jpg'
  ]),
  Fimage([
    'https://content3.flowwow-images.com/data/flowers/524x524/87/1701974678_72883487.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/51/1701974678_47992851.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/29/1701974678_48670029.jpg'
  ]),
  Fimage([
    'https://content2.flowwow-images.com/data/flowers/1000x1000/25/1708860250_47166925.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/29/1708860251_30806529.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/86/1708860251_25104686.jpg'
  ]),
  Fimage([
    'https://content3.flowwow-images.com/data/flowers/524x524/12/1646166344_82902312.jpg',
    'https://content3.flowwow-images.com/data/flowers/524x524/12/1646166344_82902312.jpg',
    'https://content3.flowwow-images.com/data/flowers/524x524/12/1646166344_82902312.jpg  '
  ]),
  Fimage([
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1677583112/lmcode/kQ230yi2XEeJYT8hUG8I-w/83248136.jpg',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1677583191/lmcode/bKFfSADTe0mBlzWsK32Nuw/83248136_03.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1634568333/lmcode/hjiajFdbzECcRliDaO6m4w/83248136_i.jpg'
  ]),
  Fimage([
    'https://content3.flowwow-images.com/data/flowers/524x524/75/1657630415_13500475.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/61/1657630415_82006361.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/82/1657630415_75394482.jpg'
  ]),
  Fimage([
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1583329765/lmcode/606aQ4Nz-0SadStrueAyLQ/13533092_04.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1583329765/lmcode/r4KINq_aUkeVlE0GkEJ9ag/13533092_05.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1643182458/lmcode/I7q05tdGoUy1u7vqYEf7mw/13533092_06.png'
  ]),
  Fimage([
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1551165906/lmcode/R5_I1XABQECMWmSWjXeZNg/12725420.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1551165909/lmcode/miZQsIKboE6LC6Y9b87TvA/12725420_01.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1551165914/lmcode/c7SH7psb9k2V4GSXjV8-WQ/12725420_03.png'
  ]),
  Fimage([
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1707922019/lmcode/wD4EnW-pPEapzBHTX3H8Lg/89352848_tmp.jpg',
    'https://luckygreen.ru/wa-data/public/shop/products/04/26/2604/images/17463/17463.970.jpg',
    'https://res.cloudinary.com/lmru/image/upload/LMCode/82404938.jpg'
  ]),
  Fimage([
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1575886527/lmcode/fTQX7a6YBUS1ss0yLI1jNQ/82399656.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1575886528/lmcode/klMC1bRIW0mHMgd12EBxAw/82399656_01.png',
    'https://cdn.leroymerlin.ru/lmru/image/upload/f_auto/q_auto/dpr_2.0/c_pad/w_1000/h_1000/v1575886537/lmcode/q3CfJADUDEOp1A2EI-kghg/82399656_03.png'
  ]),
  Fimage([
    'https://content2.flowwow-images.com/data/flowers/1000x1000/72/1690743342_65633172.jpg',
    'https://content3.flowwow-images.com/data/flowers/1000x1000/27/1690743343_8698227.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/59/1690743343_79701559.jpg'
  ]),
  Fimage([
    'https://content2.flowwow-images.com/data/flowers/1000x1000/72/1690743342_65633172.jpg',
    'https://content3.flowwow-images.com/data/flowers/1000x1000/27/1690743343_8698227.jpg',
    'https://content2.flowwow-images.com/data/flowers/1000x1000/59/1690743343_79701559.jpg'
  ])
];
